import sys
input = sys.stdin.readline

tetromino = [
    # I 테트로미노 (2가지)
    [(0,0),(0,1),(0,2),(0,3)],  # 가로
    [(0,0),(1,0),(2,0),(3,0)],  # 세로
    
    # O 테트로미노 (1가지)
    [(0,0),(0,1),(1,0),(1,1)],  # 정사각형
    
    # T 테트로미노 (4가지)
    [(0,0),(0,1),(0,2),(1,1)],  # ㅗ
    [(0,1),(1,0),(1,1),(1,2)],  # ㅜ
    [(0,1),(1,0),(1,1),(2,1)],  # ㅏ
    [(0,0),(1,0),(1,1),(2,0)],  # ㅓ
    
    # S 테트로미노 (2가지)
    [(0,1),(0,2),(1,0),(1,1)],  # 지그재그1
    [(0,0),(1,0),(1,1),(2,1)],  # 지그재그1 세로
    
    # Z 테트로미노 (2가지)
    [(0,0),(0,1),(1,1),(1,2)],  # 지그재그2
    [(0,1),(1,0),(1,1),(2,0)],  # 지그재그2 세로
    
    # J 테트로미노 (4가지)
    [(0,0),(1,0),(2,0),(2,1)],  # ㄱ
    [(0,0),(0,1),(0,2),(1,0)],  # ㄱ 90도
    [(0,0),(0,1),(1,1),(2,1)],  # ㄱ 180도
    [(0,2),(1,0),(1,1),(1,2)],  # ㄱ 270도
    
    # L 테트로미노 (4가지)
    [(0,1),(1,1),(2,1),(2,0)],  # ㄴ
    [(0,0),(1,0),(1,1),(1,2)],  # ㄴ 90도
    [(0,0),(0,1),(1,0),(2,0)],  # ㄴ 180도
    [(0,0),(0,1),(0,2),(1,2)],  # ㄴ 270도
]

n, m = map(int, input().split())
paper = [list(map(int, input().split())) for _ in range(n)]
max_value = 0

for i in range(n):
    for j in range(m):
        for t in tetromino:
            total = 0
            is_possible = True

            for dx, dy in t:
                nx = i+dx
                ny = j+dy

                if (0 <= nx < n and 0 <= ny < m):
                    total += paper[nx][ny]
                else:
                    is_possible = False
                    break
            
            if (is_possible):
                max_value = max(max_value, total)

print(max_value)